# Rebar Crank Overridable Parameters Get Crank End Angled Length Formula Params Method

Source: https://www.revitapidocs.com/2026/9d3c98e1-eb5b-2509-e65e-23f9ec277fb7.htm

---

| Rebar Crank Overridable Parameters Get Crank End Angled Length Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankEndAngledLengthFormulaParams()
```

```
Public Function GetCrankEndAngledLengthFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankEndAngledLengthFormulaParams()
```

```
member GetCrankEndAngledLengthFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Returns the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace